// 第一種寫法
station = new Array();
station[0] = [];
station[1] = [ "七張站", "小碧潭站" ]; // 小碧潭線
station[2] = [ "北投站", "新北投站" ]; // 新北投線
station[3] = [ "新店站", "新店區公所站", "七張站", "大坪林站", "景美站", "萬隆站", "公館站", "台電大樓站",
		"古亭站", "中正紀念堂站", "小南門站", "西門站", "北門站", "中山站", "松江南京站", "南京復興站",
		"台北小巨蛋站", "南京三民站", "松山站" ]; // 松山新店線
station[4] = [ "頂埔站", "永寧站", "土城站", "海山站", "亞東醫院站", "府中站", "板橋站", "新埔站",
		"江子翠站", "龍山寺站", "西門站", "台北車站", "善導寺站", "忠孝新生站", "忠孝復興站", "忠孝敦化站",
		"國父紀念館站", "市政府站", "永春站", "後山埤站", "昆陽站", "南港站", "南港展覽館站" ]; // 板南線
station[5] = [ "動物園站", "木柵站", "萬芳社區站", "萬芳醫院站", "辛亥站", "麟光站", "六張犁站", "科技大樓站",
		"大安站", "忠孝復興站", "南京復興站", "中山國中站", "松山機場站", "大直站", "劍南路站", "西湖站", "港墘站",
		"文德站", "內湖站", "大湖公園站", "葫洲站", "東湖站", "南港軟體園區站", "南港展覽館站" ]; // 文湖線
station[6] = [ "南勢角站", "景安站", "永安市場站", "頂溪站", "古亭站", "東門站", "忠孝新生站", "松江南京站",
		"行天宮站", "中山國小站", "民權西路站", "大橋頭站", "三重國小站", "三和國中站", "徐匯中學站", "三民高中站",
		"蘆洲站", "台北橋站", "菜寮站", "三重站", "先嗇宮站", "頭前庄站", "新莊站", "輔大站", "丹鳳站", "迴龍站" ]; // 中和新蘆線
station[7] = [ "象山站", "台北101世貿站", "信義安和站", "大安站", "大安森林公園站", "東門站", "中正紀念堂站",
		"台大醫院站", "台北車站", "中山站", "雙連站", "民權西路站", "圓山站", "劍潭站", "士林站", "芝山站",
		"明德站", "石牌站", "唭哩岸站", "奇岩站", "先嗇宮站", "北投站", "復興崗站", "忠義站", "關渡站",
		"竹圍站", "紅樹林", "淡水站" ]; // 淡水信義線
station[8] = [ "大坪林站", "十四張站", "秀朗橋站", "景平站", "景安站", "中和站", "橋和站", "中原站",
		"板新站", "板橋站", "新埔站", "新埔民生站", "頭前庄站", "幸福站", "新北產業園區站" ]; // 環狀線

renew();

function renew(index) {
	for (var i = 0; i < station[index].length; i++) {
		document.myForm.selectcity.options[i] = new Option(station[index][i],
				station[index][i]); // 設定新選項
		document.myForm.selectcity.length = station[index].length;
	} // 刪除多餘的選項
}
